tut04/sol04.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-05-16 Mi 18:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lösungen zum 4. Übungsblatt</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Tobias Denkinger" />
</head>
<body>
<div id="content">
<h1 class="title">Lösungen zum 4. Übungsblatt</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org33520fb">1. Lösung zu Aufgabe 1 (AGS 12.2.13)</a>
<ul>
<li><a href="#org99c5992">1.1. Teilaufgabe a</a></li>
<li><a href="#orgcdc560f">1.2. Teilaufgabe b</a></li>
</ul>
</li>
<li><a href="#orgd68691b">2. Lösung zu Aufgabe 2 (AGS 12.3.20)</a></li>
<li><a href="#orgdaaf0b4">3. Lösung zu Aufgabe 3 (AGS 12.3.11)</a></li>
<li><a href="#orga1c6aed">4. Lösung zu Aufgabe 4 (AGS 12.4.1)</a>
<ul>
<li><a href="#orgef1100b">4.1. Teilaufgabe a</a></li>
<li><a href="#org2080aca">4.2. Teilaufgabe b</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org33520fb" class="outline-2">
<h2 id="org33520fb"><span class="section-number-2">1</span> Lösung zu Aufgabe 1 (AGS 12.2.13)</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org99c5992" class="outline-3">
<h3 id="org99c5992"><span class="section-number-3">1.1</span> Teilaufgabe a</h3>
<div class="outline-text-3" id="text-1-1">
<pre class="example">
⎧ ⎛ σ(γ(x₂), σ(γ(α), x₃      )) ⎞ ⎫
⎨ ⎝ σ(x₁   , σ(γ(α), σ(α, x₁))) ⎠ ⎬
⎩                                 ⎭

Dek ⎧ ⎛ γ(x₂) ⎞  ⎛ σ(γ(α), x₃      ) ⎞ ⎫
⇒   ⎨ ⎝ x₁    ⎠, ⎝ σ(γ(α), σ(α, x₁)) ⎠ ⎬
    ⎩                                  ⎭

Dek ⎧ ⎛ γ(x₂) ⎞  ⎛ γ(α) ⎞, ⎛ x₃       ⎞ ⎫
⇒   ⎨ ⎝ x₁    ⎠, ⎝ γ(α) ⎠, ⎝ σ(α, x₁) ⎠ ⎬
    ⎩                                   ⎭

Dek ⎧ ⎛ γ(x₂) ⎞  ⎛ α ⎞, ⎛ x₃       ⎞ ⎫
⇒   ⎨ ⎝ x₁    ⎠, ⎝ α ⎠, ⎝ σ(α, x₁) ⎠ ⎬
    ⎩                                ⎭

Dek ⎧ ⎛ γ(x₂) ⎞  ⎛ x₃       ⎞ ⎫
⇒   ⎨ ⎝ x₁    ⎠, ⎝ σ(α, x₁) ⎠ ⎬
    ⎩                         ⎭

Ver ⎧ ⎛ x₁    ⎞  ⎛ x₃       ⎞ ⎫
⇒   ⎨ ⎝ γ(x₂) ⎠, ⎝ σ(α, x₁) ⎠ ⎬
    ⎩                         ⎭

Sub ⎧ ⎛ x₁    ⎞  ⎛ x₃          ⎞ ⎫
⇒   ⎨ ⎝ γ(x₂) ⎠, ⎝ σ(α, γ(x₂)) ⎠ ⎬
    ⎩                            ⎭

x₁ ↦ γ(x₂),  x₂ ↦ x₂,  x₃ ↦ σ(α, γ(x₂))
</pre>
</div>
</div>

<div id="outline-container-orgcdc560f" class="outline-3">
<h3 id="orgcdc560f"><span class="section-number-3">1.2</span> Teilaufgabe b</h3>
<div class="outline-text-3" id="text-1-2">
<p>
x₁ ↦ γ(α),  x₂ ↦ α, x₃ ↦ σ(α, γ(α))
x₁ ↦ γ(γ(x₂)),  x₂ ↦ γ(x₂),  x₃ ↦ σ(α, γ(γ(x₂)))
</p>
</div>
</div>
</div>

<div id="outline-container-orgd68691b" class="outline-2">
<h2 id="orgd68691b"><span class="section-number-2">2</span> Lösung zu Aufgabe 2 (AGS 12.3.20)</h2>
<div class="outline-text-2" id="text-2">
<p>
<b>Induktionsanfang (IA)</b>
Sei xs = [].
</p>
<div class="org-src-container">
<pre class="src src-Haskell">sum (foo []) = sum []    (2)
             = 0         (6)

2 * sum [] - length [] = 2 * 0 - length []    (6)
                       = 0 - length []
                       = 0 - 0                (10)
                       = 0
</pre>
</div>

<p>
<b>Induktionsschritt (IS)</b>
Sei xs :: [Int] sodass
  sum (foo xs) = 2 * sum xs - length xs
</p>

<p>
Sei x :: Int.
</p>
<div class="org-src-container">
<pre class="src src-Haskell">sum (foo (x : xs)) = sum (x : x : (-1) : foo xs)             (3)
                   = x + x + (-1) + sum (foo xs)             (3⋅7)
                   = x + x + (-1) + 2 * sum xs - length xs   (IH)
                   = (-1) + 2 * (x + sum xs) - length xs
                   = 2 * (x + sum xs) - (1 + length xs)
                   = 2 * sum (x : xs) - (1 + length xs)      (7)
                   = 2 * sum (x : xs) - length (x : xs)      (11)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdaaf0b4" class="outline-2">
<h2 id="orgdaaf0b4"><span class="section-number-2">3</span> Lösung zu Aufgabe 3 (AGS 12.3.11)</h2>
<div class="outline-text-2" id="text-3">
<p>
<b>Induktionsanfang (IA)</b>
Sei t = Leaf x, wobei x :: Float.
</p>

<p>
Sei a :: Float.
</p>
<div class="org-src-container">
<pre class="src src-Haskell">sum (add (Leaf x) a)
= sum (Leaf (x + a))      (4)
= x + a                   (12)
= sum (Leaf x) + a        (12)
= sum (rev (Leaf x)) + a  (8)
</pre>
</div>

<p>
<b>Induktionsschritt (IS)</b>
Seien l, r :: Tree, sodass für jedes a :: Float gilt:
  sum (add l a) = sum (rev l) + a
  sum (add r a) = sum (rev r) + a
</p>

<p>
Sei x, a :: Float.
</p>
<div class="org-src-container">
<pre class="src src-Haskell">sum (add (Branch x l r) a)
= sum (Branch (x + a / 3) (add l (a / 3)) (add r (a / 3)))    (5)
= x + a / 3 + sum (add l (a / 3)) + sum (add r (a / 3))       (13)
= x + a / 3 + sum (rev l) + a / 3 + sum (rev r) + a / 3       (IH)
= x + sum (rev r) + sum (rev l) + a
= sum (Branch x (rev r) (rev l)) + a                          (13)
= sum (rev (Branch x l r)) + a                                (9)
</pre>
</div>
</div>
</div>

<div id="outline-container-orga1c6aed" class="outline-2">
<h2 id="orga1c6aed"><span class="section-number-2">4</span> Lösung zu Aufgabe 4 (AGS 12.4.1)</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgef1100b" class="outline-3">
<h3 id="orgef1100b"><span class="section-number-3">4.1</span> Teilaufgabe a</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>(λx.xy)(λy.y)
<ul class="org-ul">
<li>GV = {x, y}   gebundene Variablen</li>
<li>FV = {y}      frei VORKOMMENDE Variablen</li>
</ul></li>
<li>(λx.(λy.z(λz.z(λx.y)))
<ul class="org-ul">
<li>GV = {x, y, z}</li>
<li>FV = {z}</li>
</ul></li>
<li>(λx.(λy.xz(yz)))(λx.y(λy.y))
<ul class="org-ul">
<li>GV = {x, y}</li>
<li>FV = {y, z}</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org2080aca" class="outline-3">
<h3 id="org2080aca"><span class="section-number-3">4.2</span> Teilaufgabe b</h3>
<div class="outline-text-3" id="text-4-2">
<p>
⇒ₐ steht für α-Konversion
</p>

<pre class="example">
(λx.(λy.xz(yz)))(λx.y(λy.y))
    ----------- ------------
    GV = {y}    FV = {y}

⇒ₐ (λx.(λy₁.xz(y₁z)))(λx,y(λy.y))

⇒ᵦ (λy₁.(λx.y(λy.y))z(y₁z))
           ------- --
           GV={y}  FV={z}

⇒ᵦ (λy₁.y(λy.y)(y₁z))


(λx.(λy.(λz.z)))x(+y1)
    ----------- -
    GV={y,z}    FV={x}

⇒ᵦ (λy.(λz.z))(+y1)
      ------  ----
      GV={z}  FV={y}

⇒ᵦ (λz.z)


(λx.(λy.x(λz.yz)))(((λx.(λy.y))8)(λx.(λy.y)x))
                                        - -
                                     GV=∅ FV={x}

⇒ᵦ (λx.(λy.x(λz.yz)))(((λx.(λy.y))8)(λx.x))
                           ----- --
                          GV={y} FV=∅

⇒ᵦ (λx.(λy.x(λz.yz)))((λy.y)(λx.x))
                         -- -----
                       GV=∅ FV=∅

⇒ᵦ (λx.(λy.x(λz.yz)))(λx.x)
      -------------  -----
      GV={y,z}       FV=∅

⇒ᵦ (λy.(λx.x)(λz.yz))
          -- ------
       GV=∅  FV={y}

⇒ᵦ (λy.(λz.yz)) = (λyz.yz)
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-05-09</p>
<p class="author">Author: Tobias Denkinger</p>
<p class="date">Created: 2018-05-16 Mi 18:28</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
